Tekla Open API Reference for Tekla Structures 2025
AngleDimension.Attributes Property
 Gets or sets the angle dimension attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AngleDimensionAttributes Attributes { get; set; }
Public Property Attributes As AngleDimensionAttributes
	Get
	Set
Property Value
Type: AngleDimensionAttributes
See Also
Reference
AngleDimension Class
Tekla.Structures.Drawing Namespace